# Задание - Файлы *.py
print('Я утром: Привет Мир!')
print('')#разделение
print('МИР: И тебе привет личинка программиcта ☺')
print('')#разделение
print('-------А ТЕПЕРЬ АРИФМЕТИКА-------')
print('')#разделение
x =2+2
print('дважды два равно:', x)
print('')#разделение
y=10/3
print('десять делим на три, получаем:', y, 'странно почему в конце "5"?')
print('')#разделение
# Задание - Переменные
print('-------Немного обо мне-------')
print('')#разделение
name = 'Anton'
print (name)
